// =========================================================
// gamebg.cpp ゲームシーン制御
// 
// 制作者:		日付：
// =========================================================
#include "main.h"
#include "texture.h"
#include "sprite.h"
#include "controller.h"
#include "gamebg.h"

// =========================================================
// グローバル変数
// =========================================================


Object_2D* gamebg;
unsigned int GamebgTextureId;//テクスチャID

// =========================================================
// ゲームシーン初期化
// =========================================================
void InitializeGamebg(void)
{
	gamebg = new Object_2D(0.0f, 0.0f, SCREEN_WIDTH, SCREEN_HEIGHT);

	// テクスチャ読み込み
	GamebgTextureId = LoadTexture("rom:/bg_01.tga");
	gamebg->texNo = GamebgTextureId;
}

// =========================================================
// ゲームシーン更新
// =========================================================

void UpdateGamebg(void)
{

}

// =========================================================
// ゲームシーン描画
// =========================================================
void DrawGamebg(void)
{
	
	
	DrawObject_2D(gamebg);
}

// =========================================================
// ゲームシーン終了処理
// =========================================================
void FinalizeGamebg(void)
{
	UnloadTexture(GamebgTextureId);
}